Masmiseim36/nxpSDK/boards/frdmk64f_mult2b/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SHIELD_InitBluetooth_InterfacePins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SHIELD_InitBluetooth_InterfacePins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t BT_WAKEUP_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 55)  */
    GPIO_PinInit(SHIELD_BT_WAKEUP_GPIO, SHIELD_BT_WAKEUP_PIN, &BT_WAKEUP_config);

    gpio_pin_config_t BT_MONITOR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 56)  */
    GPIO_PinInit(SHIELD_BT_MONITOR_GPIO, SHIELD_BT_MONITOR_PIN, &BT_MONITOR_config);

    const port_pin_config_t BT_WAKEUP = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Open drain is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as PTB2 */
                                         kPORT_MuxAsGpio,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTB2 (pin 55) is configured as PTB2 */
    PORT_SetPinConfig(SHIELD_BT_WAKEUP_PORT, SHIELD_BT_WAKEUP_PIN, &BT_WAKEUP);

    const port_pin_config_t BT_MONITOR = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTB3 */
                                          kPORT_MuxAsGpio,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTB3 (pin 56) is configured as PTB3 */
    PORT_SetPinConfig(SHIELD_BT_MONITOR_PORT, SHIELD_BT_MONITOR_PIN, &BT_MONITOR);

    const port_pin_config_t BT_RX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as UART3_RX */
                                     kPORT_MuxAlt3,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTC16 (pin 90) is configured as UART3_RX */
    PORT_SetPinConfig(SHIELD_BT_RX_PORT, SHIELD_BT_RX_PIN, &BT_RX);

    const port_pin_config_t BT_TX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as UART3_TX */
                                     kPORT_MuxAlt3,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTC17 (pin 91) is configured as UART3_TX */
    PORT_SetPinConfig(SHIELD_BT_TX_PORT, SHIELD_BT_TX_PIN, &BT_TX);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
